app/controllers/cars_controller.rb

INSERT INTO "cars" ("make", "color", "year", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["make", "Mazda"], ["color", "blue"], ["year", 2017], ["price", 9000], ["created_at", "2020-09-01 23:25:18.477788"], ["updated_at", "2020-09-01 23:25:18.477788"]]
---
  def create
    @car = Car.create!(cars_params)

UPDATE "cars" SET "make" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["make", "Toyota"], ["updated_at", "2020-09-02 16:32:33.957794"], ["id", 2]]
---
  def update
    @car.update(cars_params)