app/controllers/users_controller.rb

  def create
    @user = User.create!(users_params)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Carlos"], ["created_at", "2020-09-02 15:53:16.135776"], ["updated_at", "2020-09-02 15:53:16.135776"]]

  def update
    @user.update(users_params)
---
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Carlos Santamaria"], ["updated_at", "2020-09-02 16:08:02.505607"], ["id", 1]]